//DYNALIST JOB (001),'RUN DYNALIST',
//             CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=1024K
//JOBLIB    DD DSN=WEGSCD.LOADLIB,DISP=SHR
//        EXEC PGM=DYNALIST
//SYSIN     DD *
/*
//SYSPRINT  DD SYSOUT=A
//
