//WEGSCDX JOB (),RUN.SLEEP,CLASS=A,MSGCLASS=A,REGION=2M
//JOBLIB    DD DSN=WEGSCD.LOADLIB,DISP=SHR
//SLEEP5  EXEC PGM=SLEEP,PARM='5'
//SLEEP10 EXEC PGM=SLEEP,PARM='10'
