//WEGSCDXX JOB DOUG,IEHMOVE.VOLUME,CLASS=A,MSGCLASS=X
//MOVEIT EXEC PGM=IEHMOVE,PARM='POWER=4',REGION=4096K
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD VOL=SER=WORK02,UNIT=3380,DISP=OLD
//WEGSCD DD VOL=SER=WEGSCD,UNIT=3350,DISP=OLD
//W      DD VOL=SER=W,UNIT=3350,DISP=OLD
//SYSIN  DD *
   COPY VOLUME=3350=WEGSCD,TO=3350=W
/*

