//FHCLSM@# JOB (SYS),'Mbrot color nocmplx',CLASS=B,MSGCLASS=A,          00010000
//             MSGLEVEL=(1,1)
/*JOBPARM CARDS=9999999
//*MIN: 30s
//SIMCLG  EXEC FORTHCLG,
//             PARM.FORT='OPT=2,MAP,FORMAT'
//FORT.SYSLIN DD UNIT=SYSDA                                             00040000
//FORT.SYSUT1 DD UNIT=SYSDA,SPACE=(3465,(10,10))
//FORT.SYSUT2 DD UNIT=SYSDA,SPACE=(3465,(10,10))
//FORT.SYSABEND DD SYSOUT=A                                             00050000
//FORT.SYSIN DD *                                                       00060000
      IMPLICIT REAL*8 (A-H, O-Z)
      DATA IW /1024/
      DATA IH /1024/
C
      DATA Y0 /2.0/, Y1 /-2.0/
      DATA X0 /-2.0/, X1 /2.0/
C
      INTEGER IR(1024), IG(1024), IB(1024)
      INTEGER IIR, IIG, IIB
C
      DO 100 I = 1, 1024
       READ(5,9990,END=110) IIR, IIG, IIB
9990   FORMAT(I3,X,I3,X,I3)
       MAXITR = I
       IR(I) = IIR
       IG(I) = IIG
       IB(I) = IIB
       WRITE(6,9991) I, IIR, IIG, IIB
9991   FORMAT (5H RGB=, 4I5)
100   CONTINUE
110   MAXITR = MAXITR - 1
      WRITE (6, 9992) MAXITR
9992  FORMAT (8H MAXITR=, I4)
C
      XS = DMIN1(X0,X1)
      YS = DMAX1(Y0,Y1)
      XSPAN = DABS(X1-X0)
      YSPAN = DABS(Y1-Y0)
C
      WRITE (7, 9999) XS, YS
9999  FORMAT (18H# FORTH_nocomplex_, E14.8, 1H_, E14.8, 4H.PPM)
      WRITE (7, 9998) IW, IH
9998  FORMAT (2HP3, 2I5, 5H  256)
C
      DO 1000 IY = 1, IH
       CI = YS - ((IY-1)*YSPAN/IH)
C
       DO 500 IX = 1, IW
        CR = XS + ((IX-1)*YSPAN/IW)
        IRES = IMAND (CR, CI, ITER, MAXITR)
        IF (IRES .GT. 0) GOTO 410
C        not in the set, so color it
         WRITE (7, 9997) IR(ITER), IG(ITER),IB(ITER)
9997     FORMAT (3I5)
        GOTO 420
C        in the set. it gets black
410      WRITE (7, 9996)
9996     FORMAT (5H0 0 0)
420     CONTINUE
500    CONTINUE
1000  CONTINUE
      STOP                                                              00100000
      END                                                               00110000
      FUNCTION IMAND (CR, CI, ITER, IMX)
C     non zero return value means in set
      IMPLICIT REAL*8 (A-H, O-Z)
      ZR = 0.0
      ZI = 0.0
      ZRSQR = 0.0
      ZISQR = 0.0
      ITER = 0
      DO 100 I = 1, IMX
       ZI = ZR * ZI
       ZI = ZI + ZI
       ZI = ZI + CI
       ZR = ZRSQR - ZISQR + CR
       ZRSQR = ZR * ZR
       ZISQR = ZI * ZI
       IF (ZRSQR + ZISQR .LT. 4.0) GOTO 90
        IMAND = 0
        ITER = I
        RETURN
90     CONTINUE
100   CONTINUE
      IMAND = 1
      ITER = I
      RETURN
      END
/*
//GO.SYSIN DD *
  0   0   0
  0   0   0
  0   0   4
  0   0  12
  0   0  16
  0   0  24
  0   0  32
  0   0  36
  0   0  44
  0   0  48
  0   0  56
  0   0  64
  0   0  68
  0   0  76
  0   0  80
  0   0  88
  0   0  96
  0   0 100
  0   0 108
  0   0 116
  0   0 120
  0   0 128
  0   0 132
  0   0 140
  0   0 148
  0   0 152
  0   0 160
  0   0 164
  0   0 172
  0   0 180
  0   0 184
  0   0 192
  0   0 200
  0   4 200
  0  12 200
  0  16 204
  0  24 204
  0  28 208
  0  36 208
  0  40 208
  0  48 212
  0  56 212
  0  60 216
  0  68 216
  0  72 216
  0  80 220
  0  84 220
  0  92 224
  0 100 224
  0 104 224
  0 112 228
  0 116 228
  0 124 232
  0 128 232
  0 136 232
  0 140 236
  0 148 236
  0 156 240
  0 160 240
  0 168 240
  0 172 244
  0 180 244
  0 184 248
  0 192 248
  0 200 252
  4 200 252
 12 200 252
 20 204 252
 28 204 252
 36 208 252
 44 208 252
 52 208 252
 60 212 252
 68 212 252
 76 216 252
 84 216 252
 92 216 252
100 220 252
108 220 252
116 224 252
124 224 252
132 224 252
140 228 252
148 228 252
156 232 252
164 232 252
172 232 252
180 236 252
188 236 252
196 240 252
204 240 252
212 240 252
220 244 252
228 244 252
236 248 252
244 248 252
252 252 252
248 252 252
244 252 252
240 252 252
232 252 252
228 252 252
224 252 252
216 252 252
212 252 252
208 252 252
200 252 252
196 252 252
192 252 252
184 252 252
180 252 252
176 252 252
168 252 252
164 252 252
160 252 252
156 252 252
148 252 252
144 252 252
140 252 252
132 252 252
128 252 252
124 252 252
116 252 252
112 252 252
108 252 252
100 252 252
 96 252 252
 92 252 252
 84 252 252
 80 252 252
 76 252 252
 72 252 252
 64 252 252
 60 252 252
 56 252 252
 48 252 252
 44 252 252
 40 252 252
 32 252 252
 28 252 252
 24 252 252
 16 252 252
 12 252 252
  8 252 252
  0 252 252
  0 248 252
  0 244 252
  0 240 252
  0 232 252
  0 228 252
  0 224 252
  0 216 252
  0 212 252
  0 208 252
  0 200 252
  0 196 252
  0 192 252
  0 184 252
  0 180 252
  0 176 252
  0 168 252
  0 164 252
  0 160 252
  0 156 252
  0 148 252
  0 144 252
  0 140 252
  0 132 252
  0 128 252
  0 124 252
  0 116 252
  0 112 252
  0 108 252
  0 100 252
  0  96 252
  0  92 252
  0  84 252
  0  80 252
  0  76 252
  0  72 252
  0  64 252
  0  60 252
  0  56 252
  0  48 252
  0  44 252
  0  40 252
  0  32 252
  0  28 252
  0  24 252
  0  16 252
  0  12 252
  0   8 252
  0   0 252
  0   0 248
  0   0 244
  0   0 240
  0   0 236
  0   0 232
  0   0 228
  0   0 224
  0   0 220
  0   0 216
  0   0 212
  0   0 208
  0   0 204
  0   0 200
  0   0 196
  0   0 192
  0   0 188
  0   0 184
  0   0 180
  0   0 176
  0   0 172
  0   0 168
  0   0 164
  0   0 160
  0   0 156
  0   0 152
  0   0 148
  0   0 144
  0   0 140
  0   0 136
  0   0 132
  0   0 128
  0   0 124
  0   0 120
  0   0 116
  0   0 112
  0   0 108
  0   0 104
  0   0 100
  0   0  96
  0   0  92
  0   0  88
  0   0  84
  0   0  80
  0   0  76
  0   0  72
  0   0  68
  0   0  64
  0   0  60
  0   0  56
  0   0  52
  0   0  48
  0   0  44
  0   0  40
  0   0  36
  0   0  32
  0   0  28
  0   0  24
  0   0  20
  0   0  16
  0   0  12
  0   0   8
  0   0   0
  0   0   0
/*
//
