//WEGSCDC JOB DOUG,CLIP.W,CLASS=A,MSGCLASS=X
//WORK00  EXEC PGM=ICKDSF
//DISK     DD  UNIT=3350,VOL=SER=W,DISP=OLD
//SACLIP00 DD  DISP=SHR,DSN=SYS1.ASAMPLIB(SACLIP00)
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  REFORMAT DDNAME(DISK) IPLDD(SACLIP00) NOVERIFY
/*
