++USERMOD(ZP60038) REWORK(20190727)  /* ADD CLIST VARIABLE API */ .
++VER(Z038) FMID(EBB1102)
  PRE(UY01301,ZP60014)
 /*
   PROBLEM DESCRIPTION:
     THERE IS NO PROGRAMATIC INTERFACE FOR CLIST VARIABLE PROCESSING.
       APPLICATIONS RUNNING IN A TSO CLIST ENVIRONMENT HAVE NO
       SUPPORTED METHOD OF RETRIEVING OR SETTING THE VALUES OF CLIST
       SYMBOLIC VARIABLES.

       THIS USERMOD SUPPLIES A NEW MODULE CALLED IKJCT441 WHICH
       PROVIDES AN API TO ALLOW PROGRAMS TO PROCESS CLIST SYMBOLIC
       VARIABLES.  THE PARAMETER LIST AND RETURN CODE INTERFACE IS
       COMPATIBLE WITH THAT OF THE IKJCT441 MODULE IN IBM'S TSO/E.


   SPECIAL CONDITIONS:
     ACTION:
       A "CLPA" MUST BE PERFORMED AT IPL TIME FOR THIS SYSMOD TO
       BECOME ACTIVE.

       THE MODULE SUPPLIED IN THIS SYSMOD CALLS AN ENTRY POINT
       CREATED BY SYSMOD ZP60014.

   COMMENTS:
     PRYCROFT SIX P/L PUBLIC DOMAIN USERMOD FOR MVS 3.8 NUMBER 38.

     REWORK HISTORY:
       2018-01-20: INITIAL AVAILABILITY.
       2019-07-27: ALLOW A RETRIEVE/CREATE REQUEST TO SET A NON-NULL
                   INITIAL VALUE WHEN THE SYMBOL IS BEING CREATED.

     THE FOLLOWING MODULES AND/OR MACROS ARE AFFECTED BY THIS USERMOD:
     MODULES:
       IKJCT441
     MACROS:
       SGIKJ441
 */.
