//WEGSCD$  JOB (DOUG,5278),WSMF.LIB.COMPILE,CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//        EXEC WSMFPL,SMOD=SMFRDR,LMOD=SMFRDR,
//             ATR=ATR,XREF=XREF
