//WEGSCD$  JOB (DOUG,5278),WSMF.LIB.ASSEMBLE,CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//IHETAB  EXEC WSMFAL,SMOD=IHETAB,LMOD=IHETAB
//Y2KGTOA EXEC WSMFAL,SMOD=Y2KGTOA,LMOD=Y2KGTOA
//Y2KATOG EXEC WSMFAL,SMOD=Y2KATOG,LMOD=Y2KATOG
//Y2KJTOG EXEC WSMFAL,SMOD=Y2KJTOG,LMOD=Y2KJTOG
