//WEGSCD$  JOB (DOUG,5278),WSMF.LIB.COMPILE,CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//        EXEC WSMFPM,SMOD=DUMPMAIN,LMOD=WSMFDUMP
