//WEGSCD$  JOB (DOUG,5278),RUN.WSMFDUMP,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,0)
//GO      EXEC PGM=WSMFDUMP,
//             PARM='6,26'
//*            PARM='0'
//STEPLIB   DD DSN=WEGSCD.WSMF.LOADLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//REPORT    DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=80)
//*MFDATA   DD DSN=SMF.DAILY.DATA(0),DISP=(OLD,PASS)
//SMFDATA   DD DSN=WEGSCD.SMF,DISP=(OLD,PASS)
//*MFDATA   DD DSN=SYS1.MANY,DISP=SHR
