//WEGSCD$  JOB (DOUG,5278),WSMF.LIB.COMPILE,CLASS=A,MSGCLASS=X,
//             COND=(9,LT)
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//*
//        EXEC WSMFPM,SMOD=NULLMAIN,LMOD=WSMFNULL,
//             XREF=XREF,ATR=ATR
//*
//GO      EXEC PGM=WSMFNULL,
//             PARM=''
//STEPLIB   DD DSN=WEGSCD.WSMF.LOADLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//*MFDATA   DD DSN=SMF.DAILY.DATA(0),DISP=(OLD,PASS)
//SMFDATA   DD DSN=WEGSCD.SMF,DISP=(OLD,PASS)
//*MFDATA   DD DSN=SYS1.MANY,DISP=SHR
