//WEGSCD$  JOB (DOUG,5278),WSMF.SPLUNK.COMPILE,CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//        EXEC WSMFPM,SMOD=SPLNKMN,LMOD=WSMFSPLK,ATR=ATR
