//WEGSCD$  JOB (DOUG,5278),WSMF.LIB.COMPILE,CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=WEGSCD.WSMF.SRC,DISP=SHR,SYSPROC=NO
//*
//        EXEC WSMFPM,SMOD=TESTTABS,LMOD=WSMFTABS
//*
//GO      EXEC PGM=WSMFTABS,
//             PARM=''
//STEPLIB   DD DSN=WEGSCD.WSMF.LOADLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//REPORT    DD SYSOUT=*,DCB=(RECFM=F,BLKSIZE=80)
