//WEGSCD$  JOB (DOUG,5278),HAVE.JCL.ERRORS,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,0)
//        EXEC PL1LFCLG,REGION.PL1L=256K
//PL1L.SYSIN DD *
 BAD SOURCE
/*
//KABOOM  EXEC PGM=ZZZZZZZ
//
