 /* F_BIN31: MAKE A PRINTABLE VERSION OF A BIN(31) */

 DCL F_BIN31 ENTRY RETURNS (CHAR(9) VARYING);

 F_BIN31: PROC(I) RETURNS (CHAR(9) VARYING);
   DCL I FIXED BIN(31);
   DCL OUT CHAR(9) VARYING;
   PUT STRING(OUT) EDIT (I) (P'999999999');
   DO WHILE ((LENGTH(OUT) > 1) & (SUBSTR(OUT,1,1) = '0'));
     OUT = SUBSTR(OUT, 2, LENGTH(OUT)-1);
     END;
   RETURN (OUT);
 END F_BIN31;
