 DECLARE FIXDATE ENTRY (UNALIGNED FIXED DEC(7)) RETURNS(FIXED DEC(7));

 FIXDATE: PROC (D) RETURNS (FIXED DEC(7));
   DCL D UNALIGNED FIXED DEC(7);
   DCL RV FIXED DEC(7);
   DCL (CENTURY, YY) FIXED DEC(2);
   DCL YEAR FIXED DEC(4);
   RV = D;
   YEAR = D / 1000;
   CENTURY = YEAR / 100;
   IF (CENTURY = 0) THEN DO;
     YY = MOD(YEAR,100);
     IF (YY < 64) THEN DO; /* PROBABLY 2000 -> 2063 */
       RV = RV + 100000;
       END;
     END;
   RETURN (RV);
 END FIXDATE;
