 DECLARE F_JOBID ENTRY RETURNS (CHAR(40) VARYING);

 F_JOBID: PROC (J,D,T) RETURNS (CHAR(40) VARYING);
   DCL J CHAR(8);
   DCL T FIXED BIN(31);
   DCL D FIXED DEC(7);
   DCL OUT CHAR(40) VARYING;
   PUT STRING(OUT) EDIT
     (TRIM8(J), '-', D, '-', F_SMFTIME(T))
     (A, A, P'999.999', A, A);
   RETURN (OUT);
 END F_JOBID;
