 DECLARE F_STEPID ENTRY RETURNS (CHAR(40) VARYING);

 F_STEPID: PROC (J,D,T,S) RETURNS (CHAR(40) VARYING);
   DCL J CHAR(8);
   DCL T FIXED BIN(31);
   DCL D FIXED DEC(7);
   DCL OUT CHAR(40) VARYING;
   PUT STRING(OUT) EDIT
     (TRIM8(J), '-', D, '-', F_SMFTIME(T), '-', F_BIN31(S))
     (A, A, P'999.999', A, A, A, A);
   RETURN (OUT);
 END F_STEPID;
