 /* READ SMF FILE WITH NO HANDLERS */
 NULL00: PROC(PARM_STRING) OPTIONS(MAIN);

   DCL PARM_STRING CHAR(100) VARYING;

   DCL SMFRDR      ENTRY;

   CALL SMFRDR(PARM_STRING);
   RETURN;
 END NULL00;
