 PTRDIFF: PROC(P0, P1) RETURNS (FIXED BIN(31));
   DCL P0 POINTER;
   DCL P1 POINTER;

   DCL RV FIXED BIN(31);
   DCL I0 FIXED BIN(31);
   DCL I1 FIXED BIN(31);

   UNSPEC(I0) = UNSPEC(P0);
   UNSPEC(I1) = UNSPEC(P1);

   RV = I1 - I0;
   /* PUT FILE(REPORT) SKIP DATA(I0, I1, RV); */

   RETURN (RV);
 END PTRDIFF;
