 TSTTABS: PROC(PARM_STRING) OPTIONS(MAIN);

   DCL PARM_STRING CHAR(100) VARYING;

   DCL REPORT      PRINT;

   DCL (A, B, C, D, E) FIXED BIN(31);

   A = 1; B = 2; C = 3; D = 4; E = 5;

   PUT FILE(SYSPRINT) SKIP DATA(A, B, C, D, E);
   PUT FILE(REPORT) SKIP DATA(A, B, C, D, E);

   RETURN;
 END TSTTABS;
