 DECLARE TRIM20 ENTRY RETURNS (CHAR(20) VARYING);

 TRIM20: PROC (J) RETURNS (CHAR(20) VARYING);
   DCL J CHAR(20);
   DCL J1 CHAR(20) VARYING;
   J1 = J;
   DO WHILE ((LENGTH(J1) > 0) & SUBSTR(J1,LENGTH(J1),1) = ' ');
     J1 = SUBSTR(J1, 1, LENGTH(J1) - 1);
     END;
   RETURN (J1);
 END TRIM20;
