 DECLARE TRIM8 ENTRY RETURNS (CHAR(8) VARYING);

 TRIM8: PROC (J) RETURNS (CHAR(8) VARYING);
   DCL J CHAR(8);
   DCL J1 CHAR(8) VARYING;
   J1 = J;
   DO WHILE ((LENGTH(J1) > 0) & SUBSTR(J1,LENGTH(J1),1) = ' ');
     J1 = SUBSTR(J1, 1, LENGTH(J1) - 1);
     END;
   RETURN (J1);
 END TRIM8;
