 DECLARE TRIM4 ENTRY RETURNS (CHAR(4) VARYING);

 TRIM4: PROC (J) RETURNS (CHAR(4) VARYING);
   DCL J CHAR(4);
   DCL J1 CHAR(4) VARYING;
   J1 = J;
   DO WHILE ((LENGTH(J1) > 0) & SUBSTR(J1,LENGTH(J1),1) = ' ');
     J1 = SUBSTR(J1, 1, LENGTH(J1) - 1);
     END;
   RETURN (J1);
 END TRIM4;
