//WEGSCDCC JOB (DOUG,5278),CREATE.FILE,CLASS=A,MSGCLASS=X
//CLEANUP EXEC PGM=IEFBR14
//CREATE    DD DSN=WEGSCD.XYZ,DISP=(NEW,CATLG,DELETE),UNIT=3350,
//             SPACE=(TRK,(2,1,1),RLSE),VOL=SER=DREW,
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120)
