//DISASM   JOB (DOUG,5278),DISASSEMBLE,CLASS=A,MSGCLASS=A
//DISASM  EXEC PGM=DISASM,REGION=1000K
//SYSPUNCH  DD SYSOUT=*,DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//DISDEBUG  DD SYSOUT=*
//DISPRINT  DD SYSOUT=*
//DISPUNCH  DD SYSOUT=*
//DISMOD    DD DISP=SHR,DSN=SYS2.LINKLIB
//DISIN     DD *
MODULE   BSPPILOT
CSECT    BSPPILOT
/*
//
