//DISKMAPB JOB (WEGSCD),DISKMAPB,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//DISKMAPB EXEC PGM=DISKMAPA
//SYSPRINT  DD SYSOUT=A
//SYSOUT    DD SYSOUT=A
//SYSUT1    DD DSN=SYS1.PROCLIB,DISP=SHR
