//DISKMAPA JOB (WEGSCD),DISKMAPA,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//DISKMAPA EXEC PGM=DISKMAPA
//SYSPRINT  DD SYSOUT=A
//SYSOUT    DD SYSOUT=A
//SYSUT1    DD DSN=SYS1.PROCLIB,DISP=SHR
//SORT01    DD VOL=SER=SORT01,UNIT=SYSALLDA,DISP=OLD
