//GOTHIC   JOB (DOUG,5278),'RUN GOTHIC',
//             CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K
//S1      EXEC PGM=GOTHIC
//*SYSPRINT  DD SYSOUT=(F,,2)
//SYSPRINT  DD SYSOUT=A
//SYSIN     DD *
^Hi, Bill.		
/*
//
