//GOTHIC   JOB (001),'RUN GOTHIC',
//             CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),REGION=128K
//S1      EXEC PGM=GOTHIC
//STEPLIB   DD DSN=WEGSCD.TEST.LOADLIB,DISP=SHR
//*SYSPRINT  DD SYSOUT=(F,,2)
//SYSPRINT  DD SYSOUT=A
//SYSIN     DD *
^a/b_c		
/*
//
