//WEGSCDHX JOB (DOUG,5278),HEX.DUMP.SMF,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1)
//IDCAMS  EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//*D1       DD DSN=SMF.DAILY.DATA.G0074V00,DISP=(OLD,PASS)
//*D1       DD DSN=SYS1.MANY,DISP=SHR
//DD1       DD DSN=WEGSCD.SMF,DISP=SHR
//SYSIN     DD *
 PRINT INFILE(DD1)
/*
//
