//SMFHEX   JOB (DOUG,5278),HEX.DUMP.SMF,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//IDCAMS  EXEC PGM=IDCAMS
//SYSPRINT  DD SYSOUT=*
//DD1       DD DSN=SMF.DAILY.DATA.G0074V00,DISP=(OLD,PASS)
//SYSIN     DD *
 PRINT INFILE(DD1)
/*
//
