//WEGSCDCP JOB (DOUG,5278),IEBCOPY.TEST,CLASS=A,MSGCLASS=X,
//             COND=(4,LT)
//TEST    EXEC PGM=PL1HELLO
//STEPLIB   DD DSN=WEGSCD.LOADLIB2,DISP=SHR
//SYSPRINT  DD SYSOUT=*
