//WEGSCDIH JOB (DOUG,5278),IEHMOVE,CLASS=A,MSGCLASS=X
//MOVEPDS EXEC PGM=IEHMOVE
//SYSUT1    DD UNIT=SYSDA,VOL=SER=WORK01,DISP=SHR
//DDIN      DD UNIT=3350,VOL=SER=VSXRES,DISP=OLD
//DDOUT     DD UNIT=3350,VOL=SER=WEGSCD,DISP=OLD
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD *
          COPY PDS=USER.PROCLIB,FROM=3350=VSXRES,TO=3350=WEGSCD,       X
               RENAME=PLI.PROCLIB
/*
