//WEGSCDX1 JOB (JOBA,JOBR),'PROGRAMMER NAME',MSGCLASS=A
//STEP1   EXEC PGM=IEFBR14,ACCT=(S1A,S1R)
//STEP2   EXEC PGM=IEFBR14,ACCT=(S2A,S2R)
//STEP3   EXEC PGM=IEFBR14
//WEGSCDX2 JOB (JOBA,JOBR),'PROGRAMMER NAME',MSGCLASS=A
/*JOBPARM ROOM=JPR,
/*SETUP WEGSCD
/*MESSAGE HI BOB
//STEP1   EXEC PGM=IEFBR14,ACCT=(S1A,S1R)
//STEP2   EXEC PGM=IEFBR14,ACCT=(S2A,S2R)
//STEP3   EXEC PGM=IEFBR14
