//WEGSCDMD JOB (WEGSCD),MAPDISK.1,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1)
//MAPALL  EXEC PGM=MAPDISK
//SYSPRINT  DD DUMMY
//SYSUT2    DD SYSOUT=B
//SYSOUT    DD SYSOUT=A
//SYSUT1    DD SYSOUT=A
//DREW      DD VOL=SER=DREW,UNIT=SYSALLDA,DISP=OLD
