//WEGSCD01 JOB (DOUG,5278),SHOWMVS,CLASS=A,MSGCLASS=A
//SHOWMVS EXEC PGM=IKJEFT01
//SYSTSPRT  DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSTSIN   DD *
SHOWMVS
/*
//
