//SMFCONCT JOB (DOUG,5278),CONCATENATE.SMF,CLASS=A,MSGCLASS=A
//CLEANUP EXEC PGM=IEFBR14
//DD1       DD DSN=WEGSCD.SMF,DISP=(MOD,DELETE,DELETE),UNIT=3350,
//             SPACE=(TRK,(0))
//CONCAT  EXEC PGM=GDGCOPY,REGION=1024K,PARM='SMF.DAILY.DATA'
//SYSUT2    DD DSN=WEGSCD.SMF,DISP=(NEW,CATLG,DELETE),UNIT=3350,
//             SPACE=(CYL,(50,20),RLSE),
//             DCB=(RECFM=VBS,LRECL=8000,BLKSIZE=16000)
