//SMFFRMT  JOB (DOUG,5278),RUN.SMF.FORMAT,CLASS=A,MSGCLASS=A
//GO      EXEC PGM=SMFFRMT,
//             PARM='4'
//*            PARM='0,2,3,7,9,10,11,17,18,19,20,21,22,26,40,43'
//STEPLIB   DD DSN=WEGSCD.LINKLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//REPORT    DD SYSOUT=*,DCB=(RECFM=VA,BLKSIZE=133)
//SMFDATA   DD DSN=WEGSCD.SMF,DISP=(OLD,PASS)
//*MFDATA   DD DSN=SMF.DAILY.DATA(0),DISP=(OLD,PASS)
