//WEGSCD$ JOB DOUG,TRY.SPASM,CLASS=A,MSGCLASS=X
//SPASM  EXEC PGM=SPASM
//STEPLIB  DD DSN=SYSC.LINKLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSLIB   DD DSN=SYS1.MACLIB,DISP=SHR
//SYSIN    DD DSNAME=FILE9,UNIT=TAPE,VOL=SER=SPASM5,
//            LABEL=(9,SL,,IN),DISP=(OLD,KEEP)
//
