//SUPERLST JOB ,LIST.VTOC,CLASS=A,MSGCLASS=A
//        EXEC PGM=SUPERLST,PARM=MAP
//SYSPRINT  DD SYSOUT=*
//* these DD names must start with VOL
//VOLRES    DD DISP=SHR,UNIT=SYSALLDA,VOL=SER=MVSRES
//VOLDLB    DD DISP=SHR,UNIT=SYSALLDA,VOL=SER=MVSDLB

