//IDCAMS    JOB (1),IDCAMS.CBT421,CLASS=A,MSGCLASS=X
//IDCAMS01 EXEC PGM=IDCAMS,REGION=4096K
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *
   LISTCAT ALL
//
