//IDCAMS    JOB (1),IDCAMS.CBT421,CLASS=A,MSGCLASS=X
//IDCAMS01 EXEC PGM=IDCAMS,REGION=4096K
//SYSPRINT   DD SYSOUT=*
//CBT452     DD VOL=SER=CBT452,UNIT=3380,DISP=SHR
//SYSIN      DD *
   IMPORT CONNECT OBJECTS ( -
          SYS1.UCAT.CBT452 -
          DEVICETYPE (3380) -
          VOLUMES (CBT452) )

   DEFINE ALIAS ( -
          NAME (CBT452) -
          RELATE (SYS1.UCAT.CBT452) )
//
