//WEGSCD$  JOB (DOUG,5278),TEST.WTORCOND,CLASS=A,MSGCLASS=X
//        EXEC PGM=WTOPARM,PARM='KABLOOEIE'
//SYSPRINT  DD SYSOUT=*
//        EXEC PGM=WTORCOND,PARM='SHOULD I STAY OR SHOULD I GO'
//SYSPRINT  DD SYSOUT=*
//
