//XMIT370  JOB (DOUG,5278),XMIT370.TEST,CLASS=A,MSGCLASS=A
//S1      EXEC PGM=XMIT370
//XMITLOG   DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSUT1    DD DSN=WEGSCD.SIM1401,DISP=SHR
//SYSUT2    DD DSN=&&SYSUT2,UNIT=SYSALLDA,SPACE=(3120,(30000,30000)),
//             DISP=(,DELETE,DELETE)
//XMITOUT   DD SYSOUT=B,DCB=(LRECL=80,RECFM=F)
//SYSIN     DD DUMMY
//SYSUDUMP  DD SYSOUT=*
