//HEX      JOB (001),HEX.DUMP,CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1)
//S1      EXEC PGM=IDCAMS
//DD1       DD *
A^B/C
/*
//SYSPRINT  DD SYSOUT=A
//SYSIN     DD *
 PRINT INFILE(DD1)
/*
// 