//LISTPDS  JOB (WEGSCD),LIST.SYS1.HASPSRC,CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//LISTPDS EXEC PGM=LISTPDS
//SYSPRINT  DD SYSOUT=A
//SYSLIST   DD SYSOUT=A
//SYSLIB    DD DISP=SHR,DSN=SYS1.HASPSRC