//SCRIPT00 JOB (1),'Try to run SCRIPT',MSGLEVEL=1
//S1      EXEC PGM=SCRIPT,PARM='TWOPASS,STAT'
//STEPLIB   DD DSN=CBT429.FILE281,DISP=SHR
//SYSHYPH   DD DSN=CBT429.FILE285(HYPH),DISP=SHR
//SYSLIB    DD DSN=CBT429.FILE283,DISP=SHR
//SYSTERM   DD SYSOUT=*
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DSN=CBT429.FILE280(SCRIPT),DISP=SHR
//
