//WEGSCD$ JOB (DOUG,5278),BUILD.DYNALIST,CLASS=A,MSGCLASS=X
//DA       EXEC ASMFCL,PARM.ASM='RENT,OBJECT,NODECK,ALIGN,NOLIST',
//         PARM.LKED='LIST,LET,MAP,XREF,RENT'
//ASM.SYSPRINT DD SYSOUT=*
//ASM.SYSIN DD DSN=WEGSCD.DYNALIST.SRCLIB(DYNALIST),DISP=SHR
//LKED.SYSLMOD DD DSN=SYS2.CMDLIB,DISP=SHR
//LKED.SYSPRINT DD SYSOUT=*
//LKED.SYSIN  DD *
 NAME DYNALIST(R)
/*
//
