//WEGSCD$ JOB (),LOAD.DYNALIST,MSGCLASS=X
// EXEC PGM=IEBUPDTE
//SYSUT1 DD DSN=WEGSCD.DYNALIST.SRCLIB,DISP=OLD
//SYSUT2 DD DSN=WEGSCD.DYNALIST.SRCLIB,DISP=OLD
//SYSIN DD DSN=CBT249.FILE252.DATA,DISP=OLD,UNIT=3350,
// VOL=SER=CBT249
//SYSPRINT DD SYSOUT=*
