//WEGSCDP  JOB (DOUG,5278),COMPILE.PL1TEST,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1)
//        EXEC PL1LFCL,REGION.PL1L=256K,
//  PARM.PL1L='M,NS2,SIZE=999999,LC=60,SM=(2,72,1)',
//  PARM.LKED='NOXREF,LIST'
//PL1L.SYSLIN DD UNIT=SYSDA
//PL1L.SYSIN DD *
 PL1TEST: PROC OPTIONS(MAIN);
 DCL R CHAR(4);
 PUT FILE(SYSPRINT) SKIP LIST('CALLING PARSE');
 CALL PARSE(R);
 PUT FILE(SYSPRINT) SKIP LIST('PARSE RETURNED');
 RETURN;
 END PL1TEST;
*PROCESS
 PARSE: PROC(R);
 DCL R CHAR(4);
 DCL P POINTER;
 PUT FILE(SYSPRINT) SKIP LIST('PARSE ENTERED');

 P = ADDR(R);
 PUT FILE(SYSPRINT) SKIP LIST('CALLING UE');
 CALL UE_000(P);
 PUT FILE(SYSPRINT) SKIP LIST('UE RETURNED');

 PUT FILE(SYSPRINT) SKIP LIST('PARSE RETURNING');
 RETURN;
 END PARSE;
*PROCESS
 UE_000: PROC(P);
 DCL P POINTER;
 RETURN;
 PUT FILE(SYSPRINT) SKIP LIST('UE ENTERED');
 PUT FILE(SYSPRINT) SKIP LIST('UE RETURNING');
 END UE_000;
/*
//LKED.SYSLMOD DD DSN=WEGSCD.LOADLIB,DISP=OLD
//LKED.SYSIN DD *
 NAME PL1TEST(R)
//GO      EXEC PGM=PL1TEST,
//             PARM=''
//STEPLIB   DD DSN=WEGSCD.LOADLIB,DISP=OLD
//SYSPRINT  DD SYSOUT=*
