//WEGSCDPL JOB (DOUG,5278),'PL/I TEST',CLASS=A,MSGCLASS=X
//JOBPROC   DD DSN=PLI.PROCLIB,DISP=SHR,SYSPROC=NO
//        EXEC PLIXCLG
//PLI.SYSIN DD *
 TEST: PROC OPTIONS(MAIN);
  DISPLAY ('HI');
 END TEST;
//
