//WEGSCDTU JOB (DOUG,5278),RUN.THOUSAND,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1)
//GO      EXEC PGM=THOUSAND
//STEPLIB   DD DSN=WEGSCD.LOADLIB,DISP=SHR
//REPORT    DD SYSOUT=B
//GOBLUE  EXEC PGM=THOUSAND
//STEPLIB   DD DSN=WEGSCD.LOADLIB,DISP=SHR
//REPORT    DD SYSOUT=(B,,BLUE)
//GORED   EXEC PGM=THOUSAND
//STEPLIB   DD DSN=WEGSCD.LOADLIB,DISP=SHR
//REPORT    DD SYSOUT=(B,,RED)
//GOGRN   EXEC PGM=THOUSAND
//STEPLIB   DD DSN=WEGSCD.LOADLIB,DISP=SHR
//REPORT    DD SYSOUT=(B,,GRN)
//
